// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//
let x ;

// x = 1;
x = 0;
// x = -3;

if ( x !== 0){
    console.log('True');
}
else {
    console.log('False')
}



// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let time = 48;

if (time >= 0 && time <= 15){
    console.log("Перша четверть")
}
else if (time >= 16 && time <= 30){
    console.log("Друга четверть")
}else if (time >= 31 && time <= 45){
    console.log("Третя четверть")
}else if (time >= 46 && time <= 59){
    console.log("Четверта четверть")
}


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = 22;

if (day >=0 && day <= 10){
    console.log('Перша декада')
}else if (day >= 11 && day <= 20){
    console.log("Друга декада")
}else if (day >= 21 && day <= 31){
    console.log('Третя декада')
}



// - Скласти розклад на тиждень за домопоги switch.
// Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською)

let numberDay = 3;

switch (numberDay) {
    case  1 :
        console.log('Monday')
        break;
    case  2 :
        console.log('Thueday')
        break;
    case  3 :
        console.log('Wednesday')
        break;
    case  4 :
        console.log('Thursday')
        break;
    case  5 :
        console.log('Friday')
        break;
    case  6 :
        console.log('Suturday')
        break;
    case  7 :
        console.log('Sunday')
        break;
}


//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

let n1 = 1;
let n2 = 1;

if (n1 > n2){
    console.log(`${n1}`)
}else if (n2 > n1){
    console.log(`${n2}`)
}else  if (n1 === n2 && n2 === n1){
    console.log('FATALITY')
}



//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)\



// Перепишіть if..else, використовуючи декілька тернарних операторів '?'.
//
//     Для зручності читання рекомендується розділити код на кілька рядків.

//     let message;
//
// if (login == 'Працівник') {
//     message = 'Привіт';
// } else if (login == 'Директор') {
//     message = 'Вітаю';
// } else if (login == '') {
//     message = 'Немає логіну';
// } else {
//     message = '';
// }


let login = prompt('Ведіть пароль ')

let message = (login === 'Працівник' ) ? 'Привіт' :
    (login === 'Директор') ? 'Вітаю' :
        (login = ' ') ? 'Немає логіну' : '' ;

console.log(message)