//
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length >= 3 ){
    console.log('Це великий масив')
}else if (friends.length < 3){
    console.log('Це маленький масив')
}



// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.



// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

let a = 1;
let b = 2;
let result = (a + b < 4 ) ? 'Мало' : 'Багато' ;
console.log(result)


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let num = 0 ;

let res = (num > 0) ? 'Positive' :
    (num < 0 ) ? 'Negative' :
        (num = 0)

console.log(res)




// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = true ;
let test = false ;

if (test === true){
    console.log('True')
}else {
    console.log('Falsy')
}

//////////////////////////////////////////2//////////////////////////////////

let test2 = true ;
// let test2 = false ;

let res2 = (test2 === true) ? 'Вірно' : 'Невірно'
console.log(res2)





// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let ecma = prompt('Яка «офіційна» назва JavaScript?');
//
// if (ecma === 'ECMAScript'){
//     console.log('Правильно!');
// }else if (ecma !== 'ECMAScript'){
//     console.log('Не знаєте? ECMAScript!')
// }




//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//

let entrance = 29;

if (entrance >= 1 && entrance <= 20){
    console.log('Перший підїзд');
}else if (entrance >= 21 && entrance <= 48){
    console.log('Другий підїзд');
}else if (entrance >= 49 && entrance <= 90 ){
    console.log('Третій підїзд');
}




//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = 10 ;
let number = 11 ;
let numberResult = (number === 10) ? 'Вірно' : 'Невірно' ;
console.log(numberResult)




// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temperature = 1515;

if (temperature >= 10 && temperature <= 22 ) {
    console.log('ІДЕМО ВЧИТИСЬ');
}else {
    console.log('Сидимо вдома і вчимося ОНЛАЙН')
}




// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let gameNumber = 5;

switch (gameNumber) {
    case 1 :
        console.log('Auto')
        break;


    case 2 :
        console.log('Moto')
        break;


    case 3 :
        console.log('Phone')
        break;


    case 4 :
        console.log('Player')
        break;


    case 5 :
        console.log('Ball')
        break;

    default :
        console.log('число не вірне ...')
}









